array := []
array.Push("Горячкина", "Лагно", "Кашлинская")
; array := ["Горячкина", "Лагно", "Кашлинская", "Косинцева Надежда",
;   "Шувалова", "Косинцева Татьяна", "Костенюк", "Погонина",   "Корбут",
;   "Гиря", "Боднарук", "Галлямова", "Гунина", "Гарифуллина", "Ковалевская",
;   "Амбарцумова", "Турова", "Матвеева", "Гусева", "Бивол"]

Loop % array.Length()
{
  path := "output/" . array[A_Index] . ".txt"
  ;MsgBox % path
  file := FileOpen(path, "w")
  file.Write(array[A_Index])
  file.Close()
}

;FileSelectFile, FileName, S8,, Create a new file:
; $questions = array(
;                 array('Горячкина', 1, 8, 9),
;                 array('Лагно', 2, 9, 21),
;                 array('Кашлинская', 3, 10, 18),
;                 array('Косинцева Надежда', 4, 11, 14),
;                 array('Шувалова', 5, 12, 16),
;                 array('Косинцева Татьяна', 6, 13, 20),
;                 array('Костенюк', 7, 12, 14),
;                 array('Погонина', 1, 15, 20),
;                 array('Корбут', 2, 11, 16),
;                 array('Гиря', 3, 13, 17),
;                 array('Боднарук', 4, 12, 18),
;                 array('Галлямова', 5, 12, 19),
;                 array('Гунина', 6, 14, 20),
;                 array('Гарифуллина', 7, 11, 21),
;                 array('Ковалевская', 1, 9, 12),
;                 array('Амбарцумова', 2, 10, 11),
;                 array('Турова', 3, 11, 13),
;                 array('Матвеева', 4, 12, 19),
;                 array('Гусева', 5, 11, 13),
;                 array('Бивол', 6, 9, 14)
;             );
