Array :=
[
  "Горячкина",  ; 0
  "Лагно"       ; 1
  "Кашлинская", ; 2
  "Косинцева Надежда", ; 3
  "Шувалова", ; 4
  "Косинцева Татьяна", ; 5
  "Костенюк", ; 6
  "Погонина", ; 7
  "Корбут", ; 8
  "Гиря",   ; 9
  "Боднарук", ; 10
  "Галлямова", ; 11
  "Гунина", ; 12
  "Гарифуллина", ; 13
  "Ковалевская", ; 14
  "Амбарцумова", ; 15
  "Турова", ; 16
  "Матвеева", ; 17
  "Гусева", ; 18
  "Бивол" ; 19
]

FileSelectFile, FileName, S8,, Create a new file:
; $questions = array(
;                 array('Горячкина', 1, 8, 9),
;                 array('Лагно', 2, 9, 21),
;                 array('Кашлинская', 3, 10, 18),
;                 array('Косинцева Надежда', 4, 11, 14),
;                 array('Шувалова', 5, 12, 16),
;                 array('Косинцева Татьяна', 6, 13, 20),
;                 array('Костенюк', 7, 12, 14),
;                 array('Погонина', 1, 15, 20),
;                 array('Корбут', 2, 11, 16),
;                 array('Гиря', 3, 13, 17),
;                 array('Боднарук', 4, 12, 18),
;                 array('Галлямова', 5, 12, 19),
;                 array('Гунина', 6, 14, 20),
;                 array('Гарифуллина', 7, 11, 21),
;                 array('Ковалевская', 1, 9, 12),
;                 array('Амбарцумова', 2, 10, 11),
;                 array('Турова', 3, 11, 13),
;                 array('Матвеева', 4, 12, 19),
;                 array('Гусева', 5, 11, 13),
;                 array('Бивол', 6, 9, 14)
;             );
